[Killed] BlockStatement
src/calc.js:1:27
-export function add(a, b) {
-  return a + b
-}
+export function add(a, b) {}
 
 export function classify(n) {
killedBy: All tests
statusReason: ✖ adds two numbers (0.813542ms)
✔ classifies a big number (0.144916ms)

ℹ tests 2
ℹ suites 0
ℹ pass 1
ℹ fail 1
ℹ cancelled 0

[Killed] ArithmeticOperator
src/calc.js:2:10
 export function add(a, b) {
-  return a + b
+  return a - b
 }
 
killedBy: All tests
statusReason: ✖ adds two numbers (0.884709ms)
✔ classifies a big number (0.118083ms)

ℹ tests 2
ℹ suites 0

ℹ pass 1

[Killed] BlockStatement
src/calc.js:5:29
   return a + b
 }
 
-export function classify(n) {
-  if (n > 10) {
-    return 'big'
-  }
-  if (n > 0) {
-    return 'small'
-  }
-  return 'none'
-}
+export function classify(n) {}
 
 export function discount(total, member) {
killedBy: All tests
statusReason: ✔ adds two numbers (0.453459ms)

✖ classifies a big number (0.554375ms)

ℹ tests 2
ℹ suites 0
ℹ pass 1
ℹ fail 1

[Killed] BlockStatement
src/calc.js:6:15
 }
 
 export function classify(n) {
-  if (n > 10) {
-    return 'big'
-  }
+  if (n > 10) {}
   if (n > 0) {
     return 'small'
killedBy: All tests
statusReason: ✔ adds two numbers (0.454833ms)

✖ classifies a big number (2.164125ms)

ℹ tests 2
ℹ suites 0
ℹ pass 1
ℹ fail 1

[Killed] ConditionalExpression
src/calc.js:6:7
 }
 
 export function classify(n) {
-  if (n > 10) {
+  if (false) {
     return 'big'
   }
killedBy: All tests
statusReason: ✔ adds two numbers (0.451417ms)
✖ classifies a big number (0.557542ms)

ℹ tests 2
ℹ suites 0
ℹ pass 1
ℹ fail 1
ℹ cancelled 0

[Survived] EqualityOperator
src/calc.js:9:7
   if (n > 10) {
     return 'big'
   }
-  if (n > 0) {
+  if (n <= 0) {
     return 'small'
   }

[Survived] ConditionalExpression
src/calc.js:9:7
   if (n > 10) {
     return 'big'
   }
-  if (n > 0) {
+  if (false) {
     return 'small'
   }

[Survived] StringLiteral
src/calc.js:10:12
     return 'big'
   }
   if (n > 0) {
-    return 'small'
+    return ""
   }
   return 'none'

[Survived] BlockStatement
src/calc.js:15:41
   return 'none'
 }
 
-export function discount(total, member) {
-  if (member && total > 100) {
-    return total * 0.9
-  }
-  return total
-}
+export function discount(total, member) {}
 

[Survived] ConditionalExpression
src/calc.js:16:17
 }
 
 export function discount(total, member) {
-  if (member && total > 100) {
+  if (member && true) {
     return total * 0.9
   }

[Survived] LogicalOperator
src/calc.js:16:7
 }
 
 export function discount(total, member) {
-  if (member && total > 100) {
+  if (member || total > 100) {
     return total * 0.9
   }

[Survived] ArithmeticOperator
src/calc.js:17:12
 
 export function discount(total, member) {
   if (member && total > 100) {
-    return total * 0.9
+    return total / 0.9
   }
   return total
