[Killed] Arithmetic mutation
stryker-capture/src/Lib/Calc.cs:5:44
 
 public static class Calc
 {
-    public static int Add(int a, int b) => a + b;
+    public static int Add(int a, int b) => a - b;
 
     public static int Max(int a, int b) => a > b ? a : b;
killedBy: CalcTests.AddsTwoAndTwo

[NoCoverage] Conditional (true) mutation
stryker-capture/src/Lib/Calc.cs:7:44
 {
     public static int Add(int a, int b) => a + b;
 
-    public static int Max(int a, int b) => a > b ? a : b;
+    public static int Max(int a, int b) => (true?a :b);
 
     public static bool IsPositive(int value) => value > 0;

[NoCoverage] Equality mutation
stryker-capture/src/Lib/Calc.cs:7:44
 {
     public static int Add(int a, int b) => a + b;
 
-    public static int Max(int a, int b) => a > b ? a : b;
+    public static int Max(int a, int b) => a < b ? a : b;
 
     public static bool IsPositive(int value) => value > 0;

[Killed] Equality mutation
stryker-capture/src/Lib/Calc.cs:9:49
 
     public static int Max(int a, int b) => a > b ? a : b;
 
-    public static bool IsPositive(int value) => value > 0;
+    public static bool IsPositive(int value) => value < 0;
 }
 
killedBy: CalcTests.FiveIsPositive

[Survived] Equality mutation
stryker-capture/src/Lib/Calc.cs:9:49
 
     public static int Max(int a, int b) => a > b ? a : b;
 
-    public static bool IsPositive(int value) => value > 0;
+    public static bool IsPositive(int value) => value >= 0;
 }
 
